"""
len() 함수 : 리스트, 문자열, 튜플 등 시퀀스 자료형의 길이(요소의 개수)를 반환합니다.
len(값)  # 값의 길이(요소의 개수)를 반환합니다.

max() 함수 : 리스트, 문자열, 튜플 등 시퀀스 자료형에서 최댓값을 반환합니다.
max(값)  # 값의 최댓값을 반환합니다.

min() 함수 : 리스트, 문자열, 튜플 등 시퀀스 자료형에서 최솟값을 반환합니다.
min(값)  # 값의 최솟값을 반환합니다.

sum() 함수 : 리스트, 튜플 등 시퀀스 자료형의 모든 요소의 합을 반환합니다.
sum(값)  # 값의 모든 요소의 합을 반환합니다.

sorted() 함수 : 리스트, 튜플 등 시퀀스 자료형의 요소를 정렬하여 반환합니다.
sorted(값)  # 값의 요소를 정렬하여 반환합니다.

list() 함수 : 다른 시퀀스 자료형을 리스트로 변환합니다.
list(값)  # 값을 리스트로 변환합니다.

tuple() 함수 : 다른 시퀀스 자료형을 튜플로 변환합니다.
tuple(값)  # 값을 튜플로 변환합니다.

str() 함수 : 다른 시퀀스 자료형을 문자열로 변환합니다.  
str(값)  # 값을 문자열로 변환합니다.
"""
"""
list 메서드
append() 메서드 : 리스트의 끝에 새로운 요소를 추가합니다.
리스트.append(값)  # 리스트의 끝에 새로운 요소를 추가합니다.

extend() 메서드 : 리스트의 끝에 다른 리스트의 모든 요소를 추가합니다.
리스트.extend(값)  # 리스트의 끝에 다른 리스트의 모든 요소를 추가합니다.

insert() 메서드 : 리스트의 특정 위치에 새로운 요소를 삽입합니다.
리스트.insert(인덱스, 값)  # 리스트의 특정 위치에 새로운 요소를 삽입합니다.

remove() 메서드 : 리스트에서 특정 값을 제거합니다.
리스트.remove(값)  # 리스트에서 특정 값을 제거합니다.

pop() 메서드 : 리스트에서 특정 위치의 요소를 제거하고 반환합니다.
리스트.pop(인덱스)  # 리스트에서 특정 위치의 요소를 제거하고 반환합니다.
    
clear() 메서드 : 리스트의 모든 요소를 제거합니다.
리스트.clear()  # 리스트의 모든 요소를 제거합니다.

index() 메서드 : 리스트에서 특정 값의 인덱스를 반환합니다.
리스트.index(값)  # 리스트에서 특정 값의 인덱스를 반환합니다.

count() 메서드 : 리스트에서 특정 값의 개수를 반환합니다.
리스트.count(값)  # 리스트에서 특정 값의 개수를 반환합니다.


sort() 메서드 : 리스트의 요소를 정렬합니다.
리스트.sort()  # 리스트의 요소를 정렬합니다.


reverse() 메서드 : 리스트의 요소를 역순으로 뒤집습니다.
리스트.reverse()  # 리스트의 요소를 역순으로 뒤집습니다.
"""
